"""
tuple
本质：是一种有序集合
特点：与列表非常相似
     一旦初始化就不能修改
    使用小括号
"""
# 创建空的元组
tuple1 = ()
print(tuple1)

# 创建带有元素的元组，元组中的类型可以不同
tuple2 = (1, 2, 3, "good", True)
print(tuple2)

# 定义一个只有一个元素的元组
tuple3 = (1,)  # 1个元素后面要加，
print(tuple3)
print(type(tuple3))

# 元组元素的访问
# 格式：元组名[下标]
tuple4 = (1, 2, 3, 4)
print(tuple4[0])
print(tuple4[-1])  # 下标-1代表最后一个

# 删除元组
tuple6 = (1, 2, 3)
del tuple6
# print(tuple6)


# 元组的操作

t7 = (1, 2, 3)
t8 = (3, 4, 5, 6)
print(t7 + t8)

# 元组的重复
t10 = (1, 2, 3)
print(t10 * 3)

# 判断元素是否在元组中
t11 = (1, 2, 3, 4)
print(4 in t11)

# 元组的截取
# 格式：元组名[开始下标：结束下标]
# 从开始下标开始截取，到结束下标之前

t12 = (1, 2, 3, 4, 5, 6, 1, 11, 22)
print("t12", t12[2:6])

# 二维元组: 元素为1维元组的元组
t13 = ((1, 2, 3), (4, 5), (7, 6))
print(t13[1][1])  # 值为5

# 元组的方法
# len 返回元组中的最大值
t14 = (1, 2, 3, 5, 5)
print(len(t14))

# max() 返回元组中最大值 min() 最小值

# 将列表转成元组
list1 = [1, 2, 3, 5]
t15 = tuple(list1)
print(t15)

